In [1]:
import pandas as pd

In [2]:
# Lista
data = [['Juan', 25], ['Maria',30], ['Pedro', 40]]
print(type(data))

<class 'list'>

In [3]:
df = pd.DataFrame(data, columns=['Nombre', 'Edad'])

In [4]:
df

  Nombre  Edad
0   Juan    25
1  Maria    30
2  Pedro    40

In [17]:
# Diccionario
data = {'Nombre': ['Juan', 'Maria', 'Pedro'], 
        'Edad': [25, 30, 40]}
print(type(data))

<class 'dict'>

In [18]:
df = pd.DataFrame(data)

In [19]:
df

  Nombre  Edad
0   Juan    25
1  Maria    30
2  Pedro    40

In [20]:
# Lista de tuplas
data = [('Juan', 25), ('María',30), ('Pedro', 40)]

In [21]:
df = pd.DataFrame(data, columns=['Nombre','Edad'])

In [22]:
df

  Nombre  Edad
0   Juan    25
1  María    30
2  Pedro    40

In [29]:
df = pd.read_csv('../data/data', sep = '|')

In [30]:
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [31]:
df = pd.read_csv('../data/data.csv')

In [32]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [37]:
df = pd.read_csv('../data/data_without_header', header = None, names=["nombre","edad","ciudad"])

In [38]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [39]:
df = pd.read_json('../data/data.json')

In [46]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [41]:
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [45]:
df.head(2)

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona

In [49]:
df.tail(2)

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [50]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [52]:
df.shape

(3, 3)

In [53]:
df['nombre']

0     Juan
1    María
2    Pedro
Name: nombre, dtype: object

In [55]:
df[['nombre', 'edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [61]:
df.loc[0]['edad']

25

In [57]:
df.loc[[0,2]]

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [59]:
df[df['edad'] > 30]

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [62]:
data = {
    'grupo': ['A', 'B', 'A', 'B', 'A', 'B'],
    'valor': [10, 15, 25, 12, 27, 33]
}
df = pd.DataFrame(data)

In [63]:
df

  grupo  valor
0     A     10
1     B     15
2     A     25
3     B     12
4     A     27
5     B     33

In [64]:
df.groupby('grupo').mean()

           valor
grupo
A      20.666667
B      20.000000

In [67]:
df.groupby('grupo').sum()

       valor
grupo
A         62
B         60

In [69]:
import numpy as np

In [72]:
data = {
    'A': [1,2,np.nan,4],
    'B': [4,np.nan,5,7]
}

df = pd.DataFrame(data)

In [73]:
df

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  5.0
3  4.0  7.0

In [75]:
df_lleno = df.fillna(value='0')
df_lleno

     A    B
0  1.0  4.0
1  2.0    0
2    0  5.0
3  4.0  7.0

In [77]:
df_sin_na = df.dropna()
df_sin_na

     A    B
0  1.0  4.0
3  4.0  7.0

In [78]:
df

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  5.0
3  4.0  7.0

In [79]:
def suma(row):
    return a+b

In [80]:
df['suma']= df['A'] + df ['B']
df

     A    B  suma
0  1.0  4.0   5.0
1  2.0  NaN   NaN
2  NaN  5.0   NaN
3  4.0  7.0  11.0

In [81]:
df['dobleA'] = df['A'].apply(lambda x: x*2)
df

     A    B  suma  dobleA
0  1.0  4.0   5.0     2.0
1  2.0  NaN   NaN     4.0
2  NaN  5.0   NaN     NaN
3  4.0  7.0  11.0     8.0

In [82]:
def doble(x):
    return x*2

In [83]:
df['dobleB'] = df['B'].apply(doble)

In [84]:
df

     A    B  suma  dobleA  dobleB
0  1.0  4.0   5.0     2.0     8.0
1  2.0  NaN   NaN     4.0     NaN
2  NaN  5.0   NaN     NaN    10.0
3  4.0  7.0  11.0     8.0    14.0

In [85]:
df['suma2'] = df.apply(lambda row: row['A'] + row['B'], axis=1)
df

     A    B  suma  dobleA  dobleB  suma2
0  1.0  4.0   5.0     2.0     8.0    5.0
1  2.0  NaN   NaN     4.0     NaN    NaN
2  NaN  5.0   NaN     NaN    10.0    NaN
3  4.0  7.0  11.0     8.0    14.0   11.0

In [91]:
def suma(a, b):
    return a + b
df['suma2'] = df.apply(lambda row: suma(row['A'], row['B']), axis=1)
df

     A    B  suma  dobleA  dobleB  suma2
0  1.0  4.0   5.0     2.0     8.0    5.0
1  2.0  NaN   NaN     4.0     NaN    NaN
2  NaN  5.0   NaN     NaN    10.0    NaN
3  4.0  7.0  11.0     8.0    14.0   11.0